In [1]:
import numpy as np
import pandas as pd

In [2]:
index = [('California',2000),('California',2010),('New York',2000),('New York',2010),('Texas',2000),('Texas',2010)]
populations = [33871648,37253956,18976457,19378102,20851820,25145561]
pop = pd.Series(populations,index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [3]:
pop[('California',2010):('Texas',2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [4]:
%timeit pop[[i for i in pop.index if i[1]== 2010]]

630 µs ± 7.9 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [5]:
pop[[i for i in pop.index if i[1]== 2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

In [6]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           codes=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [7]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [8]:
pop[:,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [9]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [10]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [11]:
pop_df = pd.DataFrame({'total':pop,'under18':[9267089,9284094,4687374,4318033,5906301,6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [12]:
f_u18 = pop_df['under18']/pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [13]:
df = pd.DataFrame(np.random.rand(4,2),index=[['a','a','b','b'],[1,2,1,2]],columns=['data1','data2'])
df

        data1     data2
a 1  0.528534  0.119753
  2  0.432290  0.308595
b 1  0.239526  0.940656
  2  0.002037  0.731758

In [14]:
data={('California',2000):33871648,('California',2010):37253956,('Texas',2000):20851820,('Texas',2010):25145561,('New York',2000):18976457,('New York',2010):19378102}

In [15]:
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [16]:
pd.MultiIndex.from_arrays([['a','a','b','b'],[1,2,1,2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [17]:
pd.MultiIndex.from_tuples([('a',1),('a',2),('b',1),('b',2)])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [18]:
pd.MultiIndex.from_product([['a','b'],[1,2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [19]:
pd.MultiIndex(levels=[['a','b'],[1,2]],labels=[[0,0,1,1],[0,1,0,1]]) #it's ok

C:\Users\serge\Miniconda3\envs\py3k\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: the 'labels' keyword is deprecated, use 'codes' instead
  """Entry point for launching an IPython kernel.

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [20]:
pop.index.names

FrozenList([None, None])

In [21]:
pop.index.names=['state','year']

In [22]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [23]:
index = pd.MultiIndex.from_product([[2013,2014],[1,2]],names=['year','visits'])
columns = pd.MultiIndex.from_product([['Bob','Guido','Sue'],['HR','Temp']],names=['subject','type'])

In [24]:
data = np.round(np.random.randn(4,6),1)
data[:,::2]*=10
data+=37

In [25]:
health_data = pd.DataFrame(data,index=index,columns=columns)
health_data

subject       Bob       Guido         Sue
type           HR  Temp    HR  Temp    HR  Temp
year visits
2013 1       42.0  38.3  39.0  36.9  37.0  37.1
     2       32.0  37.8  56.0  36.2  35.0  36.5
2014 1       28.0  37.5  32.0  37.8  20.0  37.0
     2       43.0  37.9  47.0  36.9  38.0  36.7

In [26]:
health_data['Guido']

type           HR  Temp
year visits
2013 1       39.0  36.9
     2       56.0  36.2
2014 1       32.0  37.8
     2       47.0  36.9

In [27]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [28]:
pop['California',2000]

33871648

In [29]:
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [30]:
pop.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [31]:
pop[:,2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [32]:
pop[pop>22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [33]:
pop[['Californina','Texas']]

state  year
Texas  2000    20851820
       2010    25145561
dtype: int64

In [34]:
health_data

subject       Bob       Guido         Sue
type           HR  Temp    HR  Temp    HR  Temp
year visits
2013 1       42.0  38.3  39.0  36.9  37.0  37.1
     2       32.0  37.8  56.0  36.2  35.0  36.5
2014 1       28.0  37.5  32.0  37.8  20.0  37.0
     2       43.0  37.9  47.0  36.9  38.0  36.7

In [35]:
health_data['Guido','HR']

year  visits
2013  1         39.0
      2         56.0
2014  1         32.0
      2         47.0
Name: (Guido, HR), dtype: float64

In [36]:
health_data.iloc[:2,:2]

subject       Bob
type           HR  Temp
year visits
2013 1       42.0  38.3
     2       32.0  37.8

In [37]:
health_data.loc[:,('Bob','HR')]

year  visits
2013  1         42.0
      2         32.0
2014  1         28.0
      2         43.0
Name: (Bob, HR), dtype: float64

In [38]:
lealth_data.loc[(:,1),(:,'HR')]

SyntaxError: invalid syntax (<ipython-input-38-ab72a45698f8>, line 1)

In [39]:
idx = pd.IndexSlice
health_data.loc[idx[:,1],idx[:,'HR']]

subject       Bob Guido   Sue
type           HR    HR    HR
year visits
2013 1       42.0  39.0  37.0
2014 1       28.0  32.0  20.0

In [40]:
index = pd.MultiIndex.from_product([['a','c','b'],[1,2]])
data = pd.Series(np.random.rand(6),index = index)
data.index.names = ['char','int']
data

char  int
a     1      0.710474
      2      0.197425
c     1      0.408344
      2      0.543515
b     1      0.894084
      2      0.817900
dtype: float64

In [41]:
data.sort_index()

char  int
a     1      0.710474
      2      0.197425
b     1      0.894084
      2      0.817900
c     1      0.408344
      2      0.543515
dtype: float64

In [42]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [43]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [44]:
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [45]:
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [46]:
pop_flat.set_index(['state','year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

In [47]:
health_data

subject       Bob       Guido         Sue
type           HR  Temp    HR  Temp    HR  Temp
year visits
2013 1       42.0  38.3  39.0  36.9  37.0  37.1
     2       32.0  37.8  56.0  36.2  35.0  36.5
2014 1       28.0  37.5  32.0  37.8  20.0  37.0
     2       43.0  37.9  47.0  36.9  38.0  36.7

In [49]:
data_mean = health_data.mean(level='year')
data_mean

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR   Temp
year
2013     37.0  38.05  47.5  36.55  36.0  36.80
2014     35.5  37.70  39.5  37.35  29.0  36.85

In [50]:
data_mean.mean(axis=1,level='type')

type         HR       Temp
year
2013  40.166667  37.133333
2014  34.666667  37.300000